Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: Parser-level defaults can be particularly useful when working with multiple parsers. See the :meth:`~ArgumentParser.add_subparsers` method for an example of this type.
pl: Wartości domyślne na poziomie czytnika mogą być szczególnie użyteczne podczas pracy z kilkoma czytnikami. Zobacz sposób postępowania :meth:`~ArgumentParser.add_subparsers` dla przykładu tego typu.

source: Get the default value for a namespace attribute, as set by either :meth:`~ArgumentParser.add_argument` or by :meth:`~ArgumentParser.set_defaults`::
pl: Weź wartość domyślną dla przestrzeni nazw, jak ustalono przez :meth:`~ArgumentParser.add_argument` lub przez :meth:`~ArgumentParser.set_defaults`::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', default='badger') >>> parser.get_default('foo') 'badger'
pl: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', default='borsuk') >>> parser.get_default('foo') 'borsuk'

source: Printing help
pl: Wypisywanie pomocy

source: In most typical applications, :meth:`parse_args` will take care of formatting and printing any usage or error messages. However, several formatting methods are available:
pl: W najbardziej typowych aplikacjach, :meth:`parse_args` zaopiekuje się formatowaniem i wypisywaniem dowolnych wiadomości o użyciu lub błędzie. Jednakże, kilka sposobów formatowania jest możliwych:

source: Print a brief description of how the :class:`ArgumentParser` should be invoked on the command line. If ``file`` is not present, ``sys.stderr`` is assumed.
pl: Wypisz krótki opis tego jak :class:`ArgumentParser` powinien być wywoływany w wierszu poleceń. Jeśli plik ``file`` nie jest obecny, ``sys.stderr`` jest zakładany.

source: Print a help message, including the program usage and information about the arguments registered with the :class:`ArgumentParser`. If ``file`` is not present, ``sys.stderr`` is assumed.
pl: Wypisz wiadomość pomocy, zawierając użycie programu i informacje o parametrach zarejestrowanych przez uogólnienie :class:`ArgumentParser`. Jeśli parametr ``file`` nie jest obecny, ``sys.stderr`` jest podstawiany.

source: There are also variants of these methods that simply return a string instead of printing it:
pl: Istnieją także odmiany tych sposobów postępowania które po prostu zwracają ciąg znaków zamiast drukować go:

source: Return a string containing a brief description of how the :class:`ArgumentParser` should be invoked on the command line.
pl: Zwróć ciąg znaków zawierający krótki opis tego, jak :class:`ArgumentParser` powinien być wywoływany w wierszu poleceń.

source: Return a string containing a help message, including the program usage and information about the arguments registered with the :class:`ArgumentParser`.
pl: Zwróć ciąg znaków zawierający wiadomość pomocy, zawierający użycie programu, i informacje o parametrach zarejestrowanych za pomocą uogólnienia :class:`ArgumentParser`.

source: Partial parsing
pl: Częściowe wczytywanie

source: Sometimes a script may only parse a few of the command line arguments, passing the remaining arguments on to another script or program. In these cases, the :meth:`parse_known_args` method can be useful. It works much like :meth:`~ArgumentParser.parse_args` except that it does not produce an error when extra arguments are present. Instead, it returns a two item tuple containing the populated namespace and the list of remaining argument strings.
pl: Czasami skrypt może wczytać tylko kilka parametrów wiersza polecenia, przekazując pozostałe parametry dla innego skryptu lub programu. W tych przypadkach, sposób postępowania :meth:`parse_known_args` może być użyteczna. Pracuje ona tak jak :meth:`~ArgumentParser.parse_args` z wyjątkiem tego że nie produkuje ona błędu gdy dodatkowe parametry są obecne. Zamiast tego, zwraca dwuelementową krotkę zawierającą zapełnioną przestrzeń nazw i listę pozostałych ciągów znaków parametrów.

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action='store_true') >>> parser.add_argument('bar') >>> parser.parse_known_args(['--foo', '--badger', 'BAR', 'spam']) (Namespace(bar='BAR', foo=True), ['--badger', 'spam'])
pl: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', action='store_true') >>> parser.add_argument('bar') >>> parser.parse_known_args(['--foo', '--borsuk', 'BAR', 'spam']) (Namespace(bar='BAR', foo=True), ['--borsuk', 'spam'])

source: Customizing file parsing
pl: Dostosowywanie wczytywania plików

source: Arguments that are read from a file (see the ``fromfile_prefix_chars`` keyword argument to the :class:`ArgumentParser` constructor) are read one argument per line. :meth:`convert_arg_line_to_args` can be overriden for fancier reading.
pl: Parametry, które są wczytywane z pliku (zobacz parametr słowa kluczowego ``fromfile_prefix_chars`` dla konstruktora uogólnienia :class:`ArgumentParser`) są wczytywane po jednym parametrze na linię. :meth:`convert_arg_line_to_args` może być przesłonięte dla ciekawszych wczytywań.

source: This method takes a single argument ``arg_line`` which is a string read from the argument file. It returns a list of arguments parsed from this string. The method is called once per line read from the argument file, in order.
pl: Ten sposób postępowania pobiera pojedynczy parametr ``arg_line`` który jest ciągiem znaków wczytywanym z parametru pliku. Zwraca listę parametrów wczytanych z tego ciągu znaków. Sposób postępowania jest wywoływany jeden raz na linię wczytaną z parametru pliku w porządku.

source: A useful override of this method is one that treats each space-separated word as an argument::
pl: Użytecznym przesłonięciem tego sposobu postępowania jest to które traktuje każde oddzielone odstępem słowo jako parametr::

source: Upgrading optparse code
pl: Dostosowywanie kodu optparse

source: Originally, the argparse module had attempted to maintain compatibility with optparse. However, optparse was difficult to extend transparently, particularly with the changes required to support the new ``nargs=`` specifiers and better usage messages. When most everything in optparse had either been copy-pasted over or monkey-patched, it no longer seemed practical to try to maintain the backwards compatibility.
pl: Pierwotnie, moduł argparse próbował zachować zgodność z modułem optparse. Jednakże, optparse był trudny do rozszerzenia w przejrzysty sposób, szczególnie ze zmianami wymaganymi dla wsparcia nowych określeń ``nargs=`` i lepszymi wiadomościami o użyciu. Gdy prawie wszystko z optparse zostało praktycznie skopiowane lub połatane, nie wydawało się praktycznym dalej utrzymywać wsteczną zgodność.

source: A partial upgrade path from optparse to argparse:
pl: Droga częściowego dostosowania z optparse na argparse:

source: Replace all ``add_option()`` calls with :meth:`ArgumentParser.add_argument` calls.
pl: Zamień wszystkie wywołania ``add_option()`` na wywołania :meth:`ArgumentParser.add_argument`.

source: Replace ``options, args = parser.parse_args()`` with ``args = parser.parse_args()`` and add additional :meth:`ArgumentParser.add_argument` calls for the positional arguments.
pl: Zamień ``options, args = parser.parse_args()`` na ``args = parser.parse_args()`` i dodaj dodatkowe wywołania :meth:`ArgumentParser.add_argument` dla parametrów pozycyjnych.

source: Replace callback actions and the ``callback_*`` keyword arguments with ``type`` or ``action`` arguments.
pl: Zamień akcje wywołań wstecznych i parametry słów kluczowych ``callback_*`` na parametry ``type`` lub ``action`` z ang. - ``typ`` lub ``akcja``.

source: Replace string names for ``type`` keyword arguments with the corresponding type objects (e.g. int, float, complex, etc).
pl: Zamień nazwy w ciągach znaków na parametry słów kluczowych ``type`` z odpowiadającymi przedmiotami typu (np. int, float, complex, etc).

source: Replace :class:`optparse.Values` with :class:`Namespace` and :exc:`optparse.OptionError` and :exc:`optparse.OptionValueError` with :exc:`ArgumentError`.
pl: Zamień :class:`optparse.Values` na :class:`Namespace` i :exc:`optparse.OptionError` i :exc:`optparse.OptionValueError` na :exc:`ArgumentError`.

source: Replace strings with implicit arguments such as ``%default`` or ``%prog`` with the standard python syntax to use dictionaries to format strings, that is, ``%(default)s`` and ``%(prog)s``.
pl: Zamień ciągi znaków z domyślnymi parametrami takimi jak ``%default`` lub ``%prog`` na standardową składnię języka pytonowskiego aby użyć słowników dla formatowania ciągów znaków, to jest ``%(default)s`` i ``%(prog)s``.

source: Replace the OptionParser constructor ``version`` argument with a call to ``parser.add_argument('--version', action='version', version='<the version>')``
pl: Zamień parametr konstruktora OptionParser ``version`` na wywołanie ``parser.add_argument('--version', action='version', version='<the version>')``

source: :mod:`array` --- Efficient arrays of numeric values
pl: :mod:`array` --- Efektywne tablice wartości numerycznych

source: This module defines an object type which can compactly represent an array of basic values: characters, integers, floating point numbers. Arrays are sequence types and behave very much like lists, except that the type of objects stored in them is constrained. The type is specified at object creation time by using a :dfn:`type code`, which is a single character. The following type codes are defined:
pl: Ten moduł definiuje typ przedmiotu który może w zwarty sposób reprezentować tabelę podstawowych wartości: znaków, liczb całkowitych, liczb zmiennoprzecinkowych. Tablice są typami sekwencyjnymi i zachowują się bardzo podobnie do list, z wyjątkiem tego, że typy przedmiotów zachowanych w nich są ograniczone. Typ jest określony w czasie tworzenia przedmiotu przez użycie :dfn:`kodu typu` który jest pojedynczym znakiem. Następujące kody typów są określone:

source: Type code
pl: Kod typu

source: C Type
pl: typ języka C

source: Python Type
pl: typ języka pytonowskiego

source: Minimum size in bytes
pl: Minimalny rozmiar w bajtach

source: signed char
pl: typ znakowy z bitem znaku

source: unsigned char
pl: nieoznaczony typ znakowy

source: Unicode character
pl: znak Unicode

source: 2 (see note)
pl: 2 (zobacz notatkę)

source: signed short
pl: oznaczony typ krótki

source: unsigned short
pl: nieoznaczony typ krótki

source: signed int
pl: oznaczony typ int

source: unsigned int
pl: nieoznaczony typ int

source: ``'l'``
pl: ``'I'``

source: signed long
pl: oznaczony typ długi

source: unsigned long
pl: nieoznaczony typ długi

source: float
pl: typ (float) zmiennoprzecinkowy pojedynczej precyzji

source: double
pl: typ (double) zmiennoprzecinkowy podwójnej precyzji

source: The ``'u'`` typecode corresponds to Python's unicode character. On narrow Unicode builds this is 2-bytes, on wide builds this is 4-bytes.
pl: Kod typu ``'u'`` odpowiada znakowi Unicode języka pytonowskiego. Na "wąskiej" budowie Unikodu to jest 2-bajtowe, na szerokiej budowie unikodu to jest 4-bajtowe.

source: The actual representation of values is determined by the machine architecture (strictly speaking, by the C implementation). The actual size can be accessed through the :attr:`itemsize` attribute.
pl: Aktualna reprezentacja wartości jest określana przez architekturę maszyny (ściśle mówiąc przez wypełnienie C). Konkretny rozmiar może być dostępny przez właściwość :attr:`itemsize`

source: The module defines the following type:
pl: Moduł definiuje następujący typ:

source: A new array whose items are restricted by *typecode*, and initialized from the optional *initializer* value, which must be a list, object supporting the buffer interface, or iterable over elements of the appropriate type.
pl: Nowa tablica której elementy są ograniczone przez *typecode*, i zainicjowane przez opcjonalną wartość *initializer*, która musi być listą, przedmiotem obsługującym sprzęg przestrzeni wymiany, lub możliwa do iteracji ponad elementami odpowiedniego typu.

source: If given a list or string, the initializer is passed to the new array's :meth:`fromlist`, :meth:`fromstring`, or :meth:`fromunicode` method (see below) to add initial items to the array. Otherwise, the iterable initializer is passed to the :meth:`extend` method.
pl: Jeśli podano listę lub ciąg znaków, element inicjujący jest przekazywany do właściwego dla nowej tabeli sposobu postępowania :meth:`fromlist`, lub :meth:`fromstring`, lub :meth:`fromunicode` (zobacz poniżej) aby dodać początkowe wartości dla tablicy. W przeciwnym razie, możliwy do iterowania element inicjujący jest przekazywany dla sposobu postępowania :meth:`extend`.

source: Obsolete alias for :class:`array`.
pl: Przestarzały synonim uogólnienia :class:`array`.

source: A string with all available type codes.
pl: Ciąg ze wszystkimi dostępnymi kodami typów.

source: Array objects support the ordinary sequence operations of indexing, slicing, concatenation, and multiplication. When using slice assignment, the assigned value must be an array object with the same type code; in all other cases, :exc:`TypeError` is raised. Array objects also implement the buffer interface, and may be used wherever buffer objects are supported.
pl: Przedmioty tabeli wspierają zwykłe operacje na sekwencjach, indeksowania, wycinka, łączenia i powielania. Gdy używa się przypisań wycinków, przypisywana wartość musi być przedmiotem tabeli o tym samym kodzie typu; we wszystkich innych przypadkach wyjątek :exc:`TypeError` jest zgłaszany. Przedmioty tabeli wypełniają także sprzęg przestrzeni wymiany, i mogą być używane wszędzie gdzie przedmioty przestrzeni wymiany są wspierane.

source: The following data items and methods are also supported:
pl: Następujące elementy danych i sposobów postępowania są także wspierane:

source: The typecode character used to create the array.
pl: Znak kodujący typ używany do tworzenia tabeli.

source: The length in bytes of one array item in the internal representation.
pl: długość w bajtach (kęsach) jednego elementu tabeli w wewnętrznym przedstawieniu.

source: Append a new item with value *x* to the end of the array.
pl: Dodaj nowy element o wartości *x* na koniec tabeli.

source: Return a tuple ``(address, length)`` giving the current memory address and the length in elements of the buffer used to hold array's contents. The size of the memory buffer in bytes can be computed as ``array.buffer_info()[1] * array.itemsize``. This is occasionally useful when working with low-level (and inherently unsafe) I/O interfaces that require memory addresses, such as certain :cfunc:`ioctl` operations. The returned numbers are valid as long as the array exists and no length-changing operations are applied to it.
pl: Zwróć krotkę ``(adres, długość)`` dającą obecny adres w pamięci i długość w ilości elementów przestrzeni wymiany używanej do przechowywania zawartości tabeli. Rozmiar przestrzeni wymiany w kęsach (bajtach) może być obliczony jako ``array.buffer_info()[1] * array.itemsize`` To jest czasami przydatne gdy pracuje się z niskopoziomowymi (i samym przez się mniej bezpiecznym) sprzęgami wejścia/wyjścia które wymagają adresów pamięci, takich jak niektóre operacje :cfunc:`ioctl`. Zwracane liczby są ważne dopóki tabela istnieje i nie są wykonywane na niej operacje zmieniające jej długość.

source: When using array objects from code written in C or C++ (the only way to effectively make use of this information), it makes more sense to use the buffer interface supported by array objects. This method is maintained for backward compatibility and should be avoided in new code. The buffer interface is documented in :ref:`bufferobjects`.
pl: Gdy używa się tablic z kodu napisanego w języku C lub C++ (jedyna droga aby efektywnie skorzystać z tej informacji), to jest to bardziej sensowne aby użyć sprzęgu przestrzeni wymiany który jest wspierany przez przedmioty tablicowe. Ten sposób postępowania jest utrzymywany dla wstecznej zgodności i powinien być pomijany w nowym kodzie. Sprzęg przestrzeni wymiany jest opisany w :ref:`bufferobjects`.

source: "Byteswap" all items of the array. This is only supported for values which are 1, 2, 4, or 8 bytes in size; for other types of values, :exc:`RuntimeError` is raised. It is useful when reading data from a file written on a machine with a different byte order.
pl: "Zamień miejscami kęsy" - z ang. - "Byteswap" wszystkie elementy tablicy. To jest wspierane tylko dla wartości które są 1, 2, 4, lub 8 w rozmiarze; dla innych typów wartości wyjątek :exc:`RuntimeError` jest zgłaszany. Jest to użyteczne gdy wczytuje się dane z pliku zapisanym na maszynie o odmiennym porządku bajtów.

source: Return the number of occurrences of *x* in the array.
pl: Zwróć liczbę wystąpień *x* w tablicy.

source: Append items from *iterable* to the end of the array. If *iterable* is another array, it must have *exactly* the same type code; if not, :exc:`TypeError` will be raised. If *iterable* is not an array, it must be iterable and its elements must be the right type to be appended to the array.
pl: Przyklej elementy z przedmiotu *iterowalnego* na koniec tablicy. Jeśli *iterowalny* jest kolejną tablicą, musi mieć *dokładnie* ten sam typ kodu; Jeśli nie, wyjątek :exc:`TypeError będzie zgłoszony. Jeśli *iterowalny* nie jest tablicą, musi być iterowalny i jego elementy muszą być właściwego typu aby mogły być doklejone do tablicy.

source: Read *n* items (as machine values) from the file object *f* and append them to the end of the array. If less than *n* items are available, :exc:`EOFError` is raised, but the items that were available are still inserted into the array. *f* must be a real built-in file object; something else with a :meth:`read` method won't do.
pl: Wczytaj *n* elementów (jako wartości maszyny) z przedmiotu pliku *f* i doklej je na koniec tablicy. Jeśli mniej niż *n* elementów jest dostępnych, :exc:`EOFError` jest zgłaszany, ale elementy które były dostępne są wciąż wstawiane do tablicy. *f* musi być rzeczywistym wbudowanym przedmiotem pliku; coś innego ze sposobem postępowania :meth:`read` nie wystarczy zamiast.

source: Append items from the list. This is equivalent to ``for x in list: a.append(x)`` except that if there is a type error, the array is unchanged.
pl: Doklej elementy z listy. To jest równoważne z ``for x in list: a.append(x)`` z wyjątkiem tego, że jeśli wystąpi błąd typu, tablica pozostanie niezmieniona.

source: Appends items from the string, interpreting the string as an array of machine values (as if it had been read from a file using the :meth:`fromfile` method).
pl: Dokleja elementy z ciągu znaków, interpretując ciąg jako tablicę wartości maszynowych (tak jakby były one wszytane z pliku używając sposobu postępowania :meth:`fromfile`).

source: Extends this array with data from the given unicode string. The array must be a type ``'u'`` array; otherwise a :exc:`ValueError` is raised. Use ``array.fromstring(unicodestring.encode(enc))`` to append Unicode data to an array of some other type.
pl: Rozszerza tą tablicę za pomocą danych z danego ciągu znaków Unicode. Tablica musi być typu ``'u'``; w przeciwnym razie :exc:`ValueError` jest zgłaszany. Użyj ``array.fromstring(unicodestring.encode(enc))`` aby dopisać dane Unicode do tablicy innego typu.

source: Return the smallest *i* such that *i* is the index of the first occurrence of *x* in the array.
pl: Zwróć najmniejszy *i* taki że *i* jest indeksem pierwszego wystąpienia *x* w tablicy.

source: Insert a new item with value *x* in the array before position *i*. Negative values are treated as being relative to the end of the array.
pl: Wstaw nowy element o wartości *x* w tabeli przed pozycją *i*. Ujemne wartości są traktowane jako będące odniesieniem do pozycji od końca tabeli.

source: Removes the item with the index *i* from the array and returns it. The optional argument defaults to ``-1``, so that by default the last item is removed and returned.
pl: Usuwa element o indeksie *i* z tablicy i zwraca go. Opcjonalny parametr domyślnie jest ``-1``, tak aby domyślnie ostatni element był usuwany i zwracany.

source: Remove the first occurrence of *x* from the array.
pl: Usuń pierwsze wystąpienie *x* w tabeli.

source: Reverse the order of the items in the array.
pl: Odwróć kolejność elementów w tabeli.

source: Write all items (as machine values) to the file object *f*.
pl: Zapisz wszystkie elementy (jako wartości maszynowe) do przedmiotu pliku *f*.

source: Convert the array to an ordinary list with the same items.
pl: Zamień tabelę na zwykłą listę o tych samych elementach.

source: Convert the array to an array of machine values and return the string representation (the same sequence of bytes that would be written to a file by the :meth:`tofile` method.)
pl: Zamień tablicę na tablicę wartości maszynowych i zwróć reprezentację ciągu znaków (tę samą sekwencję bajtów która byłaby zapisana do pliku przez sposób postępowania :meth:`tofile`.)

source: Convert the array to a unicode string. The array must be a type ``'u'`` array; otherwise a :exc:`ValueError` is raised. Use ``array.tostring().decode(enc)`` to obtain a unicode string from an array of some other type.
pl: Zamień tablicę na ciąg znaków Unicode. Tablica musi być tablicą typu ``'u'``; w przeciwnym przypadku wyjątek :exc:`ValueError` jest zgłaszany. Użyj ``array.tostring().decode(enc)`` aby uzyskać ciąg znaków Unicode z tablicy innego typu.

source: When an array object is printed or converted to a string, it is represented as ``array(typecode, initializer)``. The *initializer* is omitted if the array is empty, otherwise it is a string if the *typecode* is ``'u'``, otherwise it is a list of numbers. The string is guaranteed to be able to be converted back to an array with the same type and value using :func:`eval`, so long as the :func:`array` function has been imported using ``from array import array``. Examples::
pl: Gdy przedmiot tablicy jest wypisywany lub zamieniany na ciąg znaków, jest on reprezentowany jako ``array(typecode, initializer)`` - z ang - ``tablica(kod typu, wartość inicjująca)`` *Wartość inicjująca* jest pomijana jeśli tablica jest pusta, w przeciwnym przypadku jest to ciąg znaków jeśli *kodem typu* jest ``'u'``, w przeciwnym razie jest to lista liczb. Ciąg znaków ma gwarantowane że będzie możliwy do skonwertowania wstecz na tablicę o tym samym typie i wartości używając zadania :func:`eval`, dopóty dopóki zadanie :func:`array` ( - z ang. - tablica) zostało zaimportowane używając ``from array import array``. Przykłady::

source: Packing and unpacking of heterogeneous binary data.
pl: Pakowanie i odpakowanie jednorodnych danych binarnych.

source: Packing and unpacking of External Data Representation (XDR) data as used in some remote procedure call systems.
pl: Pakowanie i odpakowanie Danych Zewnętrznej Reprezentacji (XDR) ( - z ang. - External Data Representation) jak używano w pewnych systemach zewnętrznego wywoływania procedur.

source: The Numeric Python extension (NumPy) defines another array type; see http://numpy.sourceforge.net/ for further information about Numerical Python. (A PDF version of the NumPy manual is available at http://numpy.sourceforge.net/numdoc/numdoc.pdf).
pl: Rozszerzenie języka pytonowskiego numerycznego (z ang. - NumPy) definiuje inny typ tablicowy; zobacz http://numpy.sourceforge.net/ dla dalszych informacji o numerycznym języku Pyton. (Wersja PDF podręcznika NumPy jest dostępna pod adresem http://numpy.sourceforge.net/numdoc/numdoc.pdf).

source: Abstract Syntax Trees
pl: Abstrakcyjne Drzewa Składniowe - z ang. - Abstract Syntax Trees
